tutorials/multiRegion/CHT/heatedDuct/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf constant/polyMesh/sets

runApplication blockMesh
runApplication snappyHexMesh
runApplication splitMeshRegions -cellZones -defaultRegionName fluid
runApplication decomposePar -allRegions
runParallel foamMultiRun
runApplication reconstructPar -allRegions
paraFoam -touchAll

#------------------------------------------------------------------------------
